Dlubal.TimberPro.ErrorType
Type of error

Dlubal.TimberPro.ErrorType.UnknownErrorType
Unknown error

Dlubal.TimberPro.ErrorType.UserErrorType
User error

Dlubal.TimberPro.ErrorType.InternalErrorType
Internal error

Dlubal.TimberPro.ErrorType.WarningType
Warning

Dlubal.TimberPro.ErrorType.CalculationErrorType
Calculation error